backgroundMesh/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    outlet_faces
    {
        type     zeroGradient;
        
    }

    inlet
    {
        type    fixedValue;
        value uniform (0 0 -1);
    }

    mirror
    {
        type symmetryPlane;
    }

    wing
    {
       type            noSlip;
    }

    overset_patch
    {
        type            overset;
    }
}

// ************************************************************************* //
