backgroundMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1250;
        startFace       282831;
    }
    outlet_faces
    {
        type            patch;
        nFaces          6250;
        startFace       284081;
    }
    mirror
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2500;
        startFace       290331;
    }
    overset_patch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          4065;
        startFace       292831;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1556;
        startFace       296896;
    }
)

// ************************************************************************* //
