backgroundMesh/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

libs		(overset fvMotionSolvers);

application     overPimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.001;

adjustTimeStep  yes;
maxCo           0.3;
maxMeshCourant  0.2;
maxDeltaT       0.005;   // optional but recommended

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"
}
