backgroundMesh/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(T)         Gauss linear;
}

divSchemes
{
     // Convective term for momentum
    div(phi,U)      Gauss linearUpwind grad(U);

    // Viscous term (Laplace operator)
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    // Default for any other fields
    default         none;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

oversetInterpolation
{
    method         inverseDistance;
}

fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}

// oversetInterpolationSuppressed
// {
//     grad(p_rgh);
//     surfaceIntegrate(phiHbyA);
// }

// ************************************************************************* //
