backgroundMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    // "alpha.water.*"
    // {
    //     nAlphaCorr      3;
    //     nAlphaSubCycles 2;
    //     cAlpha          1;
    //     icAlpha         0;
    //     scAlpha         0;

    //     MULESCorr       yes;
    //     nLimiterIter    5;
    //     alphaApplyPrevCorr  no;

    //     solver          smoothSolver;
    //     smoother        symGaussSeidel;
    //     tolerance       1e-8;
    //     relTol          0;
    // }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-11;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    // p_rgh
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-12;
    //     relTol          0.01;
    //     maxIter         500;
    // }

    // p_rghFinal
    // {
    //     $p_rgh;
    //     relTol          0;
    // }

    // pcorr
    // {
    //     $p;
    //     solver          PCG;
    //     preconditioner  DIC;
    // }

    // pcorrFinal
    // {
    //     $pcorr;
    //     relTol          0;
    // }

    // "(U|k|epsilon)"
    // {
    //     solver          smoothSolver;
    //     smoother        symGaussSeidel;
    //     tolerance       1e-6;
    //     relTol          0.01;
    //     maxIter         200;
    //     minIter         1;
    // }

    // "(U|k|epsilon)Final"
    // {
    //     $U;
    //     relTol          0;
    // }
}

PIMPLE
{
    momentumPredictor   no;
    correctPhi          no;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    ddtCorr             true;
}

relaxationFactors
{
   fields
   {
   }
   equations
   {
       ".*"             1;
   }
}

// ************************************************************************* //
